// Напишите функцию которая принимает имя(string)
// и выводит в консоль "Hello " + "имя"


// Напишите функцию которая принимает число(number)
// возвращает(return) число умноженое на 10


// Напишите функцию которая выводит в консоль 
// все значения свойств данного объекта
const myCar = {
    make: 'Honda',
    model: 'Civic',
    info: {
        color: 'red',
        mileage: 10000,
        isPopular: true
    },
    year: 2020
}


// Напишите функцию которая увеличит свойство mileage
// на 5000, используйте объект myCar


// Напишите функцию которая будет принимать массив и число в качестве аргумента
// будет добавлять число в заданый массив


// Напите функцию которая будет выводить в консоль
// каждый элемент данного массива и его тип данных
const mixedArray = [134, 'Hello', true, {a: 10, b: 20}, null, [1, 2, 3], 'Hero'];


// Выведите в консоль строку используя данный массив
// Пример: This is Jack Smith. He is 30 years old. It is true that he is employed and his salary is 2000 euro.
const personArray = ['Jack', 'Smith', 30, {salary: 2000, employement: true}]


// Напищите код, который для каждой пары в заданом массиве
// будет возводить первое число в степень второго числа
// и выводить результаты в консоль
const numberPairs = [[2, 5], [3, 2], [6, 7], [3, 4], [5, 3]];
